II1302-8/dockpulse-iot/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Bluetooth + NimBLE host (no NimBLE-mesh — its FreeRTOS port is
# incomplete: per-buffer adv events are never ble_npl_event_init'd and
# the legacy adv worker is gated #ifdef MYNEWT, so the first publish
# crashes). We use Espressif's esp_ble_mesh stack instead — same
# Bluetooth Mesh on the wire, but a thoroughly-tested implementation
# that also runs on the NimBLE host.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_NIMBLE_MESH is not set

# esp_ble_mesh — node + provisioner, both enabled. We use the
# provisioner role to self-configure each device's local keys/bindings;
# we never on-board another device over the air.
CONFIG_BLE_MESH=y
CONFIG_BLE_MESH_NODE=y
CONFIG_BLE_MESH_PROVISIONER=y
CONFIG_BLE_MESH_PB_ADV=y
# cfg client used by gateway to push AppKey + Model App Bind + Model Pub Set
# to a freshly provisioned sensor. Linked on sensor too (unused there) so a
# single image config covers both roles.
CONFIG_BLE_MESH_CFG_CLI=y
# CONFIG_BLE_MESH_PB_GATT is not set
# CONFIG_BLE_MESH_GATT_PROXY_SERVER is not set
CONFIG_BLE_MESH_RELAY=y
CONFIG_BLE_MESH_USE_DUPLICATE_SCAN=y
# Default 1 saturates fast when publishes overlap. 10 matches the
# vendor_models example and gives plenty of headroom even at <1s
# publish cadence.
CONFIG_BLE_MESH_TX_SEG_MSG_COUNT=10
CONFIG_BLE_MESH_RX_SEG_MSG_COUNT=10

# Persist subnet, app keys, model bindings, and the per-source sequence
# counter to NVS. Without this the sensor restarts seq at 0 after every
# power cycle and the gateway's replay-protection list rejects the
# resulting low-seq packets as replays — silent data loss for any
# sensor that legitimately reboots (deep sleep, brown-out, hard
# repower).
CONFIG_BLE_MESH_SETTINGS=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Route the console to USB-Serial-JTAG instead of UART0. UART0's TX
# FIFO blocks the writer task when no host is reading; the sensor's
# per-cycle ESP_LOGI calls (including the RADAR CSV trace) hang the
# publish loop until tools/monitor.sh opens the port. USB-Serial-JTAG
# drops bytes silently when no host is attached, so the application
# task keeps running.
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# NimBLE GAP logs every advertise stop/start at INFO. The mesh stack
# cycles these every ~100ms so they drown the application logs.
# Drop NimBLE itself to WARNING; our `dp_mesh:` lines stay at INFO.
# CONFIG_BT_NIMBLE_LOG_LEVEL_INFO is not set
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# NVS for persistent state (mesh provisioning, calibration)
CONFIG_NVS_ENCRYPTION=n

# Power: defaults; per-role overrides in main/Kconfig.projbuild
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Flash + partitioning (assumes 4MB module — ESP32-C3 SuperMini etc.)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Compiler
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
